pergunta.txt


<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v300="http://www.cnj.jus.br/mni/v300/" xmlns:tip="http://www.cnj.jus.br/mni/v300/tipos-servico-intercomunicacao" xmlns:int="http://www.cnj.jus.br/mni/v300/intercomunicacao">
   <soapenv:Header/>
   <soapenv:Body>
      <v300:requisicaoEntregarPeticao>
         <tip:manifestante>
            <!--You have a CHOICE of the next 3 items at this level-->
            <!--<int:token>?</int:token>-->
            <int:autenticacaoSimples>
               <int:usuario>USUARIO</int:usuario>
               <int:senha>SENHA</int:senha>
            </int:autenticacaoSimples>
            <!--
            <int:autenticacaoCertificada>
               <int:assinatura>cid:1411345145622</int:assinatura>
               <int:dataAssinatura>?</int:dataAssinatura>
               <int:cadeiaCertificado>?</int:cadeiaCertificado>
               <int:algoritmo>sha256WithRSAEncryption</int:algoritmo>
               <int:codificacaoCadeiaCertificado>PEM</int:codificacaoCadeiaCertificado>
            </int:autenticacaoCertificada>
            -->
            <!--Optional:-->
            <!--<int:pessoaVinculada>?</int:pessoaVinculada>-->
         </tip:manifestante>
         <tip:numeroProcesso>NUMERO PROCESSO</tip:numeroProcesso>
         <!--1 or more repetitions:-->
         <tip:documentos>
            <!--<int:idDocumento>?</int:idDocumento>-->
            <int:codigoTipoDocumento>82400092</int:codigoTipoDocumento>
            <int:conteudo>
               <int:mimetype>application/pdf</int:mimetype>
               <int:conteudo></int:conteudo>
            </int:conteudo>
            <int:documentoVinculado/>
            <int:outroParametro nome="NomeDocumentoUsuario" valor="TEXTO LIVRE.pdf"/>
            <int:outroParametro nome="ObsDocumento" valor="ObsDocumentoTeste"/>
            <int:parametros nome="identProcuradorRepresentacao" valor="NUMERO CPF"/>
            <int:parametros nome="tipoIdentProcuradorRepresentacao" valor="CPF"/>
         </tip:documentos>
      </v300:requisicaoEntregarPeticao>
   </soapenv:Body>
</soapenv:Envelope>
  


<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" 
                   xmlns:ns1="http://www.cnj.jus.br/mni/v300/intercomunicacao" 
                   xmlns:ns2="http://www.cnj.jus.br/mni/v300/tipos-servico-intercomunicacao" 
                   xmlns:ns3="http://www.cnj.jus.br/mni/v300/" 
                   xmlns:xmime="http://www.w3.org/2005/05/xmlmime" 
                   xmlns:xop="http://www.w3.org/2004/08/xop/include">
   <SOAP-ENV:Body>
      <ns3:respostaEntregarPeticao>
         <ns2:recibo>
            <ns1:recibo>
               <ns1:sucesso>true</ns1:sucesso>
               <ns1:mensagens>
                  <ns1:descritivo>Petição processada com sucesso.</ns1:descritivo>
                  <ns1:codigo>0</ns1:codigo>
                  <ns1:codigoUnico/>
                  <ns1:tipo>INFORMACAO</ns1:tipo>
               </ns1:mensagens>
            </ns1:recibo>
            <ns1:numeroProtocolo>611754596372619087042764604636</ns1:numeroProtocolo>
            <ns1:dataOperacao>2025-08-07T16:52:52-03:00</ns1:dataOperacao>
            <ns1:documentoComprovante>
               <xop:Include href="cid:urn:uuid:9f20f979-7a54-481d-93f2-637271cb9a9a"/>
            </ns1:documentoComprovante>
            <ns1:reciboDocumentos>
               <ns1:hashDocumento/>
               <ns1:dataRecebimento/>
               <ns1:numeroProcesso>40039215520258260960</ns1:numeroProcesso>
            </ns1:reciboDocumentos>
         </ns2:recibo>
      </ns3:respostaEntregarPeticao>
   </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
  